ANALYZER_DESC = """
<b>📦 Название раздела:</b> Анализатор тестов

<b>📋 Описание</b>:
Здесь вы можете загрузить CSV-файл с результатами тестов пользователя, а бот автоматически сформирует  подробный профиль компетенций. На выходе вы получите наглядный анализ сильных и слабых сторон, оценку навыков и рекомендации  по развитию. Просто загрузите файл, и бот обработает данные за считанные секунды!"""

PARSER_DESC = """
<b>📦 Название раздела:</b> Парсер документов

<b>📋 Описание</b>:
Здесь вы можете загрузить PDF или DOCX файл, а бот с помощью NLP-модели автоматически сегментирует документ на разделы. На выходе вы получите структурированные данные в формате JSON, где ключами будут заголовки разделов, а значениями — соответствующий текст. Это позволяет быстро анализировать большие документы и извлекать нужную информацию без ручной работы. Просто загрузите файл, и бот подготовит удобный для обработки JSON!"""

GENERATOR_DESC = """
📦 <b>Название раздела:</b> Генератор контента

📋 <b>Описание:</b>
Бот анализирует профиль компетенций студента и предоставленные учебные материалы, чтобы создавать индивидуальные задания. На выходе формируются короткие тесты с упором на пробелы в знаниях и компактные конспекты по наиболее сложным темам. Такой подход позволяет ускорить подготовку к изучению и повторению, концентрируясь на ключевых трудностях студента."""